Revit 2024 API
ColorWithTransparency.GetRed Method
 get red
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public uint GetRed()
Visual Basic
Public Function GetRed As UInteger
Visual C++
public:
unsigned int GetRed()
Return Value
 red
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace